package main

import "fmt"

//1.题目：企业发放的奖金根据利润提成。
//利润(I)低于或等于10万元时，奖金可提10%；
//利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
//20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；
//60万到100万之间时，高于60万元的部分，可提成1.5%；
//高于100万元时，超过100万元的部分按1%提成从键盘输入当月利润，求应发放奖金总数？
//2.程序分析：请利用数轴来分界，定位。

func main08(){
	var profit, bonus float64
	fmt.Println("请输出利润金额:")
	fmt.Scan(&profit)
	if profit <= 100000{
		bonus = profit * 0.1
		fmt.Println("您的奖金是：",bonus)
	}else if profit <= 200000 {
		bonus = 100000 * 0.1 + (bonus - 100000) * 0.075
		fmt.Println("您的奖金是：",bonus)
	}else if profit <= 400000{
		bonus = 100000 * 0.1 + 100000 * 0.075 + (bonus-200000)*0.05
		fmt.Println("您的奖金是：",bonus)
	}else if profit <= 600000{
		bonus = 100000 * 0.1+100000*0.075+200000*0.05+(bonus-400000)*0.03
		fmt.Println("您的奖金是：",bonus)
	}else if profit<=1000000{
		bonus = 100000 * 0.1+100000*0.075+200000*0.05+200000*0.03+(bonus-600000)*0.015
		fmt.Println("您的奖金是：",bonus)
	}else if profit>1000000{
		bonus = 100000 * 0.1+100000*0.075+200000*0.05+200000*0.03+400000*0.15+(bonus-1000000)*0.01
		fmt.Println("您的奖金是：",bonus)
	}
}